class GroupStructure {
  static const Map<String, dynamic> structure = {
    "اداری": {
      "ریاست": {},

      "معاونت ها": {
        "آموزش ابتدایی": {},

        "آموزش متوسطه": {},

        "تربیت بدنی و پرورشی": {},

        "توسعه مدیریت و پشتیبانی": {},

        "پژوهش و آموزش نیروی انسانی": {},
      },

      "مناطق و اداره کل": {},
    },

    "مدارس": {
      "ابتدایی": {
        "دولتی": {"پسرانه": {}, "دخترانه": {}},

        "غیردولتی": {"پسرانه": {}, "دخترانه": {}},
      },

      "متوسطه دوره اول": {
        "دولتی": {"پسرانه": {}, "دخترانه": {}},

        "غیردولتی": {"پسرانه": {}, "دخترانه": {}},
      },

      "متوسطه دوره دوم": {
        "نظری": {
          "دولتی": {"پسرانه": {}, "دخترانه": {}},

          "غیردولتی": {"پسرانه": {}, "دخترانه": {}},
        },

        "فنی و کاردانش": {
          "دولتی": {"پسرانه": {}, "دخترانه": {}},

          "غیردولتی": {"پسرانه": {}, "دخترانه": {}},
        },
      },
    },

    "آموزشگاه های زبان و علمی": {
      "زبان": {"پسرانه": {}, "دخترانه": {}},

      "علمی": {"پسرانه": {}, "دخترانه": {}},
    },

    "مراکز رفاهی و خدماتی": {},
  };
}
